
## :x: Apply Failed

[CI link](https://github.com/AI1411/terraform-ecs/actions/runs/4624132614)



It failed to parse the result.

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-01e8f0711944f630e]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-09546da07a4d3a277]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0e045ce1b00c1ae71]
aws_security_group.ecs: Refreshing state... [id=sg-072ed778c4dcf4979]
aws_security_group.alb: Refreshing state... [id=sg-0913f06e7e46d9d88]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0b14a6d3c53e3d5f7]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-08bd2e8d1f95541a0]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-034910cb1cab13f5d]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0d3200ffc3ea6afea]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-03b1e0e9db27f8104]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-04f10a644e50be262]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-02b5539fe45e6327b]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-02e8ee5062f5fe950]
aws_security_group_rule.ecs_from_alb: Refreshing state... [id=sgrule-1318507288]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0dc05b5fb1b3132df]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-017b30897b472f820]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0bf2e0c94a12ca98a]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-018706a2db074f9f1]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-03b1e0e9db27f81041080289494]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0053b16448220511f]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0e9905288523882a7]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-04f10a644e50be2621080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0d3200ffc3ea6afea1080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_lb.alb will be created
  + resource "aws_lb" "alb" {
      + arn                                         = (known after apply)
      + arn_suffix                                  = (known after apply)
      + desync_mitigation_mode                      = "defensive"
      + dns_name                                    = (known after apply)
      + drop_invalid_header_fields                  = false
      + enable_deletion_protection                  = false
      + enable_http2                                = true
      + enable_tls_version_and_cipher_suite_headers = false
      + enable_waf_fail_open                        = false
      + enable_xff_client_port                      = false
      + id                                          = (known after apply)
      + idle_timeout                                = 60
      + internal                                    = false
      + ip_address_type                             = (known after apply)
      + load_balancer_type                          = "application"
      + name                                        = "golang-simple-grpc-server-alb"
      + preserve_host_header                        = false
      + security_groups                             = [
          + "sg-0913f06e7e46d9d88",
        ]
      + subnets                                     = [
          + "subnet-08bd2e8d1f95541a0",
          + "subnet-0b14a6d3c53e3d5f7",
        ]
      + tags_all                                    = (known after apply)
      + vpc_id                                      = (known after apply)
      + xff_header_processing_mode                  = "append"
      + zone_id                                     = (known after apply)
    }

  # aws_lb_listener.alb_listener will be created
  + resource "aws_lb_listener" "alb_listener" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
              + message_body = "fixed response content"
              + status_code  = "200"
            }
        }
    }

  # aws_lb_listener_rule.alb_listener_rule will be created
  + resource "aws_lb_listener_rule" "alb_listener_rule" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = (known after apply)
      + tags_all     = (known after apply)

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "foward"
        }

      + condition {
          + path_pattern {
              + values = [
                  + "*",
                ]
            }
        }
    }

  # aws_lb_target_group.target_group will be created
  + resource "aws_lb_target_group" "target_group" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "golang-simple-grpc-server-tg"
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "ip"
      + vpc_id                             = "vpc-0e045ce1b00c1ae71"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = (known after apply)
          + path                = "/health"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 3
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.
aws_lb_target_group.target_group: Creating...
aws_lb.alb: Creating...
aws_lb_target_group.target_group: Creation complete after 2s [id=arn:aws:elasticloadbalancing:ap-northeast-1:459535173592:targetgroup/golang-simple-grpc-server-tg/6d51f00e08691e38]
aws_lb.alb: Still creating... [10s elapsed]
aws_lb.alb: Still creating... [20s elapsed]
aws_lb.alb: Still creating... [30s elapsed]
aws_lb.alb: Still creating... [40s elapsed]
aws_lb.alb: Still creating... [50s elapsed]
aws_lb.alb: Still creating... [1m0s elapsed]
aws_lb.alb: Still creating... [1m10s elapsed]
aws_lb.alb: Still creating... [1m20s elapsed]
aws_lb.alb: Still creating... [1m30s elapsed]
aws_lb.alb: Still creating... [1m40s elapsed]
aws_lb.alb: Still creating... [1m50s elapsed]
aws_lb.alb: Still creating... [2m0s elapsed]
aws_lb.alb: Still creating... [2m10s elapsed]
aws_lb.alb: Creation complete after 2m13s [id=arn:aws:elasticloadbalancing:ap-northeast-1:459535173592:loadbalancer/app/golang-simple-grpc-server-alb/283f2e95656ad05f]
aws_lb_listener.alb_listener: Creating...
aws_lb_listener.alb_listener: Creation complete after 1s [id=arn:aws:elasticloadbalancing:ap-northeast-1:459535173592:listener/app/golang-simple-grpc-server-alb/283f2e95656ad05f/1340e81c30d6da98]
╷
│ Error: expected action.0.type to be one of [forward authenticate-oidc authenticate-cognito redirect fixed-response], got foward
│ 
│   with aws_lb_listener_rule.alb_listener_rule,
│   on alb.tf line 29, in resource "aws_lb_listener_rule" "alb_listener_rule":
│   29:     type             = "foward"
│ 
╵
Releasing state lock. This may take a few moments...

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":4,"Program":"tfcmt","SHA1":"2e823ec6f57bf31ee6f3e65c2938fb90cf59f9ef","Vars":{},"WorkflowName":"Terraform"} -->